Terraform Plan:
```[0m[1maws_ecs_cluster.fargate_cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:941133421128:cluster/fargate-cluster][0m
[0m[1maws_efs_file_system.efs_prometheus: Refreshing state... [id=fs-031dac1ce266a92c7][0m
[0m[1maws_efs_file_system.efs_grafana: Refreshing state... [id=fs-0e3471ee7cfd1a176][0m
[0m[1maws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467][0m
[0m[1maws_eip.nat_eip: Refreshing state... [id=eipalloc-0769fc3f0a1e0369d][0m
[0m[1maws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_execution_role][0m
[0m[1maws_ecs_task_definition.prometheus: Refreshing state... [id=prometheus][0m
[0m[1maws_ecs_task_definition.grafana: Refreshing state... [id=grafana][0m
[0m[1maws_subnet.private2: Refreshing state... [id=subnet-03869eba2620a72a4][0m
[0m[1maws_subnet.public1: Refreshing state... [id=subnet-0e8a8b2387a038517][0m
[0m[1maws_internet_gateway.gw: Refreshing state... [id=igw-023eff6b19fbc8386][0m
[0m[1maws_subnet.private1: Refreshing state... [id=subnet-0dd981dc576918c96][0m
[0m[1maws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a][0m
[0m[1maws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/80498dd36909bb7a][0m
[0m[1maws_security_group.fargate_sg: Refreshing state... [id=sg-0788f6d6e7e5e4270][0m
[0m[1maws_route_table.public: Refreshing state... [id=rtb-054b7988ab4f56ef5][0m
[0m[1maws_nat_gateway.nat: Refreshing state... [id=nat-0e9b83e07e82ff8ea][0m
[0m[1maws_lb.grafana_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/20f01ea24b47aea8][0m
[0m[1maws_efs_mount_target.efs_grafana_mt["subnet-0dd981dc576918c96"]: Refreshing state... [id=fsmt-0d08edfda6c7313d3][0m
[0m[1maws_efs_mount_target.efs_prometheus_mt["subnet-03869eba2620a72a4"]: Refreshing state... [id=fsmt-018fd38abb3272337][0m
[0m[1maws_efs_mount_target.efs_prometheus_mt["subnet-0dd981dc576918c96"]: Refreshing state... [id=fsmt-06d19b233905805db][0m
[0m[1maws_ecs_service.prometheus_service: Refreshing state... [id=arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/prometheus-service][0m
[0m[1maws_efs_mount_target.efs_grafana_mt["subnet-03869eba2620a72a4"]: Refreshing state... [id=fsmt-0f6c0057cd74ab816][0m
[0m[1maws_route_table_association.public1: Refreshing state... [id=rtbassoc-0577b7cf0865f9b59][0m
[0m[1maws_route_table_association.public2: Refreshing state... [id=rtbassoc-0a6f1e2a1d786d5c9][0m
[0m[1maws_route_table.private: Refreshing state... [id=rtb-00c56dde623266ee6][0m
[0m[1maws_route_table_association.private2: Refreshing state... [id=rtbassoc-0e8b878ffd48b9d71][0m
[0m[1maws_route_table_association.private1: Refreshing state... [id=rtbassoc-0530eb8faa8321338][0m
[0m[1maws_lb_listener.grafana_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/20f01ea24b47aea8/7691719dfc462932][0m
[0m[1maws_ecs_service.grafana_service: Refreshing state... [id=arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/grafana-service][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # aws_cloudwatch_log_group.ecs_log_group[0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "ecs_log_group" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/ecs/siem"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 0
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags_all          = (known after apply)
    }

[1m  # aws_ecs_service.grafana_service[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ecs_service" "grafana_service" {
        id                                 = "arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/grafana-service"
        name                               = "grafana-service"
        tags                               = {}
      [33m~[0m[0m task_definition                    = "arn:aws:ecs:us-east-1:941133421128:task-definition/grafana:7" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_ecs_service.prometheus_service[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_ecs_service" "prometheus_service" {
        id                                 = "arn:aws:ecs:us-east-1:941133421128:service/fargate-cluster/prometheus-service"
        name                               = "prometheus-service"
        tags                               = {}
      [33m~[0m[0m task_definition                    = "arn:aws:ecs:us-east-1:941133421128:task-definition/prometheus:4" -> (known after apply)
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_ecs_task_definition.grafana[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_ecs_task_definition" "grafana" {
      [33m~[0m[0m arn                      = "arn:aws:ecs:us-east-1:941133421128:task-definition/grafana:7" -> (known after apply)
      [33m~[0m[0m arn_without_revision     = "arn:aws:ecs:us-east-1:941133421128:task-definition/grafana" -> (known after apply)
      [33m~[0m[0m container_definitions    = jsonencode(
          [33m~[0m[0m [
              [33m~[0m[0m {
                  [31m-[0m[0m environment      = []
                  [32m+[0m[0m logConfiguration = {
                      [32m+[0m[0m logDriver = "awslogs"
                      [32m+[0m[0m options   = {
                          [32m+[0m[0m awslogs-group         = "/ecs/siem"
                          [32m+[0m[0m awslogs-region        = "us-east-1"
                          [32m+[0m[0m awslogs-stream-prefix = "grafana"
                        }
                    }
                    name             = "grafana"
                  [33m~[0m[0m portMappings     = [
                      [33m~[0m[0m {
                          [31m-[0m[0m protocol      = "tcp"
                            [90m# (2 unchanged attributes hidden)[0m[0m
                        },
                    ]
                  [31m-[0m[0m volumesFrom      = []
                    [90m# (6 unchanged attributes hidden)[0m[0m
                },
            ] [31m# forces replacement[0m[0m
        )
      [33m~[0m[0m id                       = "grafana" -> (known after apply)
      [33m~[0m[0m revision                 = 7 -> (known after apply)
      [31m-[0m[0m tags                     = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all                 = {} -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # aws_ecs_task_definition.prometheus[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_ecs_task_definition" "prometheus" {
      [33m~[0m[0m arn                      = "arn:aws:ecs:us-east-1:941133421128:task-definition/prometheus:4" -> (known after apply)
      [33m~[0m[0m arn_without_revision     = "arn:aws:ecs:us-east-1:941133421128:task-definition/prometheus" -> (known after apply)
      [33m~[0m[0m container_definitions    = jsonencode(
          [33m~[0m[0m [
              [33m~[0m[0m {
                  [31m-[0m[0m environment      = []
                  [32m+[0m[0m logConfiguration = {
                      [32m+[0m[0m logDriver = "awslogs"
                      [32m+[0m[0m options   = {
                          [32m+[0m[0m awslogs-group         = "/ecs/siem"
                          [32m+[0m[0m awslogs-region        = "us-east-1"
                          [32m+[0m[0m awslogs-stream-prefix = "prometheus"
                        }
                    }
                    name             = "prometheus"
                  [33m~[0m[0m portMappings     = [
                      [33m~[0m[0m {
                          [31m-[0m[0m protocol      = "tcp"
                            [90m# (2 unchanged attributes hidden)[0m[0m
                        },
                    ]
                  [31m-[0m[0m volumesFrom      = []
                    [90m# (6 unchanged attributes hidden)[0m[0m
                },
            ] [31m# forces replacement[0m[0m
        )
      [33m~[0m[0m id                       = "prometheus" -> (known after apply)
      [33m~[0m[0m revision                 = 4 -> (known after apply)
      [31m-[0m[0m tags                     = {} [90m-> null[0m[0m
      [33m~[0m[0m tags_all                 = {} -> (known after apply)
        [90m# (7 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # aws_efs_file_system.efs_grafana[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_efs_file_system" "efs_grafana" {
        id                              = "fs-0e3471ee7cfd1a176"
      [33m~[0m[0m tags                            = {
          [32m+[0m[0m "Name" = "efs-grafana"
        }
      [33m~[0m[0m tags_all                        = {
          [32m+[0m[0m "Name" = "efs-grafana"
        }
        [90m# (10 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # aws_efs_file_system.efs_prometheus[0m will be updated in-place
[0m  [33m~[0m[0m resource "aws_efs_file_system" "efs_prometheus" {
        id                              = "fs-031dac1ce266a92c7"
      [33m~[0m[0m tags                            = {
          [32m+[0m[0m "Name" = "efs-prometheus"
        }
      [33m~[0m[0m tags_all                        = {
          [32m+[0m[0m "Name" = "efs-prometheus"
        }
        [90m# (10 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1mPlan:[0m 3 to add, 4 to change, 2 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```